Revit 2027 API
ParameterTypeId.BendingDetailTypeSegmentLengthDimensionTypeId Property
 "Linear Dimension Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionTypeId { get; }
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthDimensionTypeId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthDimensionTypeId {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeSegmentLengthDimensionTypeId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace